templateCase/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3e-6;

boundaryField
{
    inlet
    {
        type                freestream;
        freestreamValue	    uniform 3e-6;
    }

    outlet
    {
        type            	freestream;
        freestreamValue	    uniform 3e-6;
    }

    object
    {
        type            fixedValue;
        value           uniform 0;
    }

    freeStream
    {
        type            	freestream;
        freestreamValue	    uniform 3e-6;
    }
    
    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
