templateCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.000000210438;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.000000210438;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 0.000000210438;
    }

    object
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
    freeStream
    {
        type            slip;
    }
    
    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
